6_semester/КИСП/Курсовая/src/Documents/ПоступлениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>AccountingRegister.Проводки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

6_semester/КИСП/Курсовая/src/AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

6_semester/КИСП/Курсовая/src/Documents/ПоступлениеТоваров/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// Группируем товары для правильного расчета средней себестоимости
	ТаблицаТоваров = Товары.Выгрузить();
	ТаблицаТоваров.Свернуть("Номенклатура", "Количество, Сумма");
	
	Для Каждого СтрокаТЧ Из ТаблицаТоваров Цикл
		// Движения по складу
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = СтрокаТЧ.Номенклатура;
		Движение.Количество = СтрокаТЧ.Количество;
		
		// Бухгалтерия
		ДвижениеБух = Движения.Проводки.Добавить();
		ДвижениеБух.Период = Дата;
		ДвижениеБух.СчетДт = ПланыСчетов.Управленческий.Касса; // Временно касса (расход)
		ДвижениеБух.СчетКт = ПланыСчетов.Управленческий.Касса;
		ДвижениеБух.Сумма = -СтрокаТЧ.Сумма; // Расход денег
		
		// Расчет средней себестоимости
		НомОбъект = СтрокаТЧ.Номенклатура.ПолучитьОбъект();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ЕСТЬNULL(СУММА(КоличествоОстаток), 0) КАК Остаток ИЗ РегистрНакопления.ОстаткиТоваров.Остатки(&Период, Номенклатура = &Ном)";
		Запрос.УстановитьПараметр("Период", Дата);
		Запрос.УстановитьПараметр("Ном", СтрокаТЧ.Номенклатура);
		Выборка = Запрос.Выполнить().Выбрать();
		ТекущийОстаток = 0;
		Если Выборка.Следующий() Тогда
			ТекущийОстаток = Выборка.Остаток;
		КонецЕсли;
		
		ТекущаяСебестоимость = НомОбъект.Себестоимость;
		ТекущаяСтоимость = ТекущийОстаток * ТекущаяСебестоимость;
		
		НовоеКоличество = ТекущийОстаток + СтрокаТЧ.Количество;
		НоваяСтоимость = ТекущаяСтоимость + СтрокаТЧ.Сумма;
		
		Если НовоеКоличество > 0 Тогда
			НомОбъект.Себестоимость = НоваяСтоимость / НовоеКоличество;
		Иначе
			НомОбъект.Себестоимость = 0;
		КонецЕсли;
		
		НомОбъект.Записать();
	КонецЦикла;
КонецПроцедуры
